mbTest/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

72
(
    frontAndBack
    {
        type            patch;
        nFaces          550;
        startFace       1795360;
    }
    inlet
    {
        type            patch;
        nFaces          110;
        startFace       1795910;
    }
    outlet
    {
        type            patch;
        nFaces          110;
        startFace       1796020;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7145;
        startFace       1796130;
    }
    upperWall
    {
        type            patch;
        nFaces          250;
        startFace       1803275;
    }
    motorBike_frt-fairing:001%1
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          8512;
        startFace       1803525;
    }
    motorBike_windshield:002%2
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          78;
        startFace       1812037;
    }
    motorBike_rr-wh-rim:005%5
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          209;
        startFace       1812115;
    }
    motorBike_rr-wh-rim:010%10
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          498;
        startFace       1812324;
    }
    motorBike_fr-wh-rim:011%11
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          745;
        startFace       1812822;
    }
    motorBike_fr-wh-brake-disk:012%12
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          85;
        startFace       1813567;
    }
    motorBike_frame:016-shadow%13
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          155;
        startFace       1813652;
    }
    motorBike_rear-susp:014%14
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1312;
        startFace       1813807;
    }
    motorBike_rear-susp:014-shadow%15
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          752;
        startFace       1815119;
    }
    motorBike_frame:016%16
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          99;
        startFace       1815871;
    }
    motorBike_rr-wh-rim:005-shadow%17
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          122;
        startFace       1815970;
    }
    motorBike_rr-wh-chain-hub:022%22
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          175;
        startFace       1816092;
    }
    motorBike_rearseat%24
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          626;
        startFace       1816267;
    }
    motorBike_frt-fairing%25
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          960;
        startFace       1816893;
    }
    motorBike_windshield%26
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          574;
        startFace       1817853;
    }
    motorBike_headlights%27
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          248;
        startFace       1818427;
    }
    motorBike_driversseat%28
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          590;
        startFace       1818675;
    }
    motorBike_rear-body%29
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          3101;
        startFace       1819265;
    }
    motorBike_fuel-tank%30
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1391;
        startFace       1822366;
    }
    motorBike_exhaust%31
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          3784;
        startFace       1823757;
    }
    motorBike_rr-wh-rim%32
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2035;
        startFace       1827541;
    }
    motorBike_fr-mud-guard%33
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1104;
        startFace       1829576;
    }
    motorBike_fr-wh-rim%34
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          963;
        startFace       1830680;
    }
    motorBike_fr-wh-brake-disk%35
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          591;
        startFace       1831643;
    }
    motorBike_fr-brake-caliper%36
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          228;
        startFace       1832234;
    }
    motorBike_fr-wh-tyre%37
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1852;
        startFace       1832462;
    }
    motorBike_hbars%38
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          811;
        startFace       1834314;
    }
    motorBike_fr-forks%39
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1701;
        startFace       1835125;
    }
    motorBike_chain%40
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          728;
        startFace       1836826;
    }
    motorBike_rr-wh-tyre%41
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2460;
        startFace       1837554;
    }
    motorBike_square-dial%42
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          9;
        startFace       1840014;
    }
    motorBike_round-dial%43
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          23;
        startFace       1840023;
    }
    motorBike_dial-holder%44
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          134;
        startFace       1840046;
    }
    motorBike_rear-susp%45
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          2770;
        startFace       1840180;
    }
    motorBike_rear-brake-lights%46
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          80;
        startFace       1842950;
    }
    motorBike_rear-light-bracket%47
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          250;
        startFace       1843030;
    }
    motorBike_frame%48
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          3117;
        startFace       1843280;
    }
    motorBike_rear-mud-guard%49
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          991;
        startFace       1846397;
    }
    motorBike_rear-susp-spring-damp%50
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          153;
        startFace       1847388;
    }
    motorBike_fairing-inner-plate%51
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          703;
        startFace       1847541;
    }
    motorBike_clutch-housing%52
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1501;
        startFace       1848244;
    }
    motorBike_radiator%53
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          78;
        startFace       1849745;
    }
    motorBike_water-pipe%54
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          144;
        startFace       1849823;
    }
    motorBike_water-pump%55
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          108;
        startFace       1849967;
    }
    motorBike_engine%56
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          3654;
        startFace       1850075;
    }
    motorBike_rear-shock-link%57
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          31;
        startFace       1853729;
    }
    motorBike_rear-brake-fluid-pot-bracket%58
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          58;
        startFace       1853760;
    }
    motorBike_rear-brake-fluid-pot%59
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          84;
        startFace       1853818;
    }
    motorBike_footpeg%60
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          139;
        startFace       1853902;
    }
    motorBike_rr-wh-chain-hub%61
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          180;
        startFace       1854041;
    }
    motorBike_rear-brake-caliper%62
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          193;
        startFace       1854221;
    }
    motorBike_rider-helmet%65
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          912;
        startFace       1854414;
    }
    motorBike_rider-visor%66
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          262;
        startFace       1855326;
    }
    motorBike_rider-boots%67
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          1545;
        startFace       1855588;
    }
    motorBike_rider-gloves%68
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          481;
        startFace       1857133;
    }
    motorBike_rider-body%69
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          6999;
        startFace       1857614;
    }
    motorBike_frame:0%70
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          53;
        startFace       1864613;
    }
    motorBike_frt-fairing:001-shadow%74
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          5203;
        startFace       1864666;
    }
    motorBike_windshield-shadow%75
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          399;
        startFace       1869869;
    }
    motorBike_fr-mud-guard-shadow%81
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          684;
        startFace       1870268;
    }
    motorBike_fr-wh-brake-disk-shadow%83
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          372;
        startFace       1870952;
    }
    motorBike_rear-mud-guard-shadow%84
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          660;
        startFace       1871324;
    }
    motorBike_rear-susp-spring-damp-shadow%85
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          105;
        startFace       1871984;
    }
    motorBike_radiator-shadow%86
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          57;
        startFace       1872089;
    }
    motorBike_rear-shock-link-shadow%87
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          18;
        startFace       1872146;
    }
    motorBike_rear-brake-fluid-pot-bracket-shadow%88
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          33;
        startFace       1872164;
    }
    motorBike_rr-wh-chain-hub-shadow%89
    {
        type            wall;
        inGroups        2(motorBikeGroup wall);
        nFaces          110;
        startFace       1872197;
    }
)

// ************************************************************************* //
